01  WS-AREA-1 PIC X(100). 
01  WS-AREA-2 PIC 9(5) VALUE 0. 
01  WS-OVERFLOW-FLAG PIC 9 VALUE 0. 

PROCEDURE DIVISION. 
    ADD 1 TO WS-AREA-2 ON SIZE ERROR SET WS-OVERFLOW-FLAG TO 1. 
    DISPLAY WS-AREA-2. 
    IF WS-OVERFLOW-FLAG = 1 THEN
        MOVE 'OVERFLOW' TO WS-AREA-1
        DISPLAY 'Numeric Overflow occurred!' 
    ELSE IF WS-AREA-2 > 100 THEN
        MOVE 'OVERFLOW' TO WS-AREA-1
    END-IF. 
    DISPLAY WS-AREA-1. 
    STOP RUN.